
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Касса.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК ОстатокВКассе
		|ИЗ
		|	РегистрНакопления.Касса.Остатки(&МВ, ) КАК КассаОстатки";
	
	Запрос.УстановитьПараметр("МВ", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Сумма > ВыборкаДетальныеЗаписи.ОстатокВКассе Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В кассе не хватает " + (Сумма - ВыборкаДетальныеЗаписи.ОстатокВКассе) + " руб.";
			Сообщение.Поле = "Сумма";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			Движение = Движения.Касса.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = Сумма;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
