
Процедура ПриЗаписи(Отказ)
	
	Для каждого СтрокаТЧ Из Товары Цикл
		Сообщить ("" + СтрокаТЧ.Номенклатура + ": цена продажи в справочнике - " + СтрокаТЧ.Номенклатура.ЦенаПродажи + " руб., цена покупки в документе - " + СтрокаТЧ.Цена + " руб.");
	КонецЦикла; 
	  
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваровНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Сумма;
		
		Движение = Движения.ОстаткиТоваровНаСкладах.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
