
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТЗВывод = Новый ТаблицаЗначений;
	
	ТЗВывод.Колонки.Добавить("Автомобиль");
	ТЗВывод.Колонки.Добавить("ТипКузова");
	ТЗВывод.Колонки.Добавить("Производитель");
	ТЗВывод.Колонки.Добавить("Количество");
	ТЗВывод.Колонки.Добавить("Сумма");
	
	НоваяСтрока = ТЗВывод.Добавить();
	НоваяСтрока.Автомобиль = "Лада";
	НоваяСтрока.ТипКузова = "Седан";
	НоваяСтрока.Производитель = "Россия";
	НоваяСтрока.Количество = 20;
	НоваяСтрока.Сумма = 10000000;
	
	НоваяСтрока = ТЗВывод.Добавить();
	НоваяСтрока.Автомобиль = "Ситроен";
	НоваяСтрока.ТипКузова = "Хэтчбек";
	НоваяСтрока.Производитель = "Франция";
	НоваяСтрока.Количество = 5;
	НоваяСтрока.Сумма = 6000000;
	
	НоваяСтрока = ТЗВывод.Добавить();
	НоваяСтрока.Автомобиль = "Тойота";
	НоваяСтрока.ТипКузова = "Пикап";
	НоваяСтрока.Производитель = "Япония";
	НоваяСтрока.Количество = 2;
	НоваяСтрока.Сумма = 5000000;
	
	НоваяСтрока = ТЗВывод.Добавить();
	НоваяСтрока.Автомобиль = "Мицубиси";
	НоваяСтрока.ТипКузова = "Седан";
	НоваяСтрока.Производитель = "Япония";
	НоваяСтрока.Количество = 4;
	НоваяСтрока.Сумма = 4500000;
	
	// 1
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");	
	
	// 2
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// 3
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки =
	КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//4
	НаборДанных = Новый Структура("ТабЗнач", ТЗВывод);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, НаборДанных, ДанныеРасшифровки);
	
	// 5
	ДокументРезультат.Очистить();
	ПроцессорВывода = 
	Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры
