
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаказПокупателя.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Дата,
	|	ЗаказПокупателя.КонтактноеЛицо,
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Покупатель,
	|	ЗаказПокупателя.СуммаПоДокументу,
	|	ЗаказПокупателя.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьНаимФирм = Макет.ПолучитьОбласть("Фирма");
	МояОбласть = Макет.ПолучитьОбласть("МояОбласть");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		// Обращение к параметрам области макета по индексам параметров
		ОбластьЗаголовок.Параметры.Установить(0, Выборка.Номер);
		ОбластьЗаголовок.Параметры.Установить(1, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
		ТабДок.Вывести(ОбластьЗаголовок);

		ОбластьНаимФирм.Параметры.НаимФирм = 
		ОбщегоНазначения_Сервер.ПолучитьНаименованиеФирмы();
		ТабДок.Вывести(ОбластьНаимФирм);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество() > 0 Тогда
			ТабДок.Вывести(ОбластьТоварыШапка);
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;	

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		// Обращение к параметру области макета по имени параметра
		МояОбласть.Параметры.ТекДата = ТекущаяДата();
		ТабДок.Вывести(МояОбласть);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
