
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	
	МассивРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	ПолеРасшифровки = МассивРасшифровки[0];
	ЗначениеРасшифровки = МассивРасшифровки[1];
	
	Если ПолеРасшифровки = "Наименование" Тогда
		
		ОткрытьЗначение(ЗначениеРасшифровки);
		
	ИначеЕсли ПолеРасшифровки = "МестоРождения" Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("МестоРождения", ЗначениеРасшифровки);
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("Отбор", Отбор);
		
		ЭтаФорма.Закрыть();
		ОткрытьФорму("Отчет.ФизическиеЛица.Форма.ФормаОтчета", ПараметрыОтчета);
			
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)

	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	КоллекцияПолей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	
	Если КоллекцияПолей.Количество() > 0 Тогда
		МассивВозврат = Новый Массив;
		МассивВозврат.Добавить(КоллекцияПолей[0].Поле);
		МассивВозврат.Добавить(КоллекцияПолей[0].Значение);
		Возврат МассивВозврат;
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка)[1];
	
	Если ТипЗнч(ЗначениеРасшифровки) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", ЗначениеРасшифровки);
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("ЖурналДокументов.КадровыеДокументы.ФормаСписка", ПараметрыОтчета);
			
	КонецЕсли;
КонецПроцедуры


