
&НаКлиенте
Процедура ПриОткрытии555(Отказ)

	Сегодня = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Цена = 
	ПолучитьЦенуПродажи(ТекущиеДанныеТаблицы.Номенклатура);
	
	//ТекущиеДанныеТаблицы.Сумма =
	//ТекущиеДанныеТаблицы.Цена * ТекущиеДанныеТаблицы.Количество;
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПродажи(Товар)

	Возврат Товар.ЦенаПродажи;

КонецФункции // ПолучитьЦенуПродажи()

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	//ТекущиеДанныеТаблицы.Сумма =
	//ТекущиеДанныеТаблицы.Цена * ТекущиеДанныеТаблицы.Количество;
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	Объект.СуммаПоДокументу = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Покупатель <> ВыбранноеЗначение Тогда
		Объект.КонтактноеЛицо = "";
	КонецЕсли;	
	
КонецПроцедуры
