
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	
	Если ТипЗнч(ЗначениеРасшифровки) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЗначениеРасшифровки);
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладах.Форма", ПараметрыОтчета);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	КоллекцияПолей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	
	Если КоллекцияПолей.Количество() > 0 Тогда
		Возврат КоллекцияПолей[0].Значение;
	КонецЕсли;	
	          
КонецФункции
