
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Валюта = Элементы.Список.ТекущаяСтрока; /// Ссылка на валюту
	
	Курс = ПолучитьКурсВалюты(Валюта);
	
	Если Курс = Неопределено Тогда
		Элементы.КурсВалюты.Заголовок =	"Данные о курсе валюты " + Валюта + " отсутствуют!";
	Иначе	
		Элементы.КурсВалюты.Заголовок =
		"Курс валюты " + Валюта + " на " + Формат(НужнаяДата, "ДЛФ=DD") +
		" составляет " + Курс + " руб.";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты(Вал)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Период КАК Период,
	               |	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	               |	КурсыВалютСрезПоследних.Курс КАК Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", НужнаяДата);
	Запрос.УстановитьПараметр("Валюта", Вал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Курс = ?(РезультатЗапроса.Пустой(), Неопределено, РезультатЗапроса.Выгрузить()[0].Курс);
	
	Возврат Курс;

КонецФункции // ПолучитьКурсВалюты()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НужнаяДата = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте
Процедура НужнаяДатаПриИзменении(Элемент)
	
	СписокПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

