
&НаКлиенте
Процедура ПокупательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Покупатель <> ВыбранноеЗначение Тогда
		Объект.КонтактноеЛицо = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Цена = ПолучитьЦенуПродажи(ТекущиеДанныеТаблицы.Номенклатура);
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПродажи(Товар)

	Возврат Товар.ЦенаПродажи;

КонецФункции // ПолучитьЦенуПродажи()

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры
