
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.Родитель = Справочники.ФизическиеЛица.УВОЛЕННЫЕ;
	СотрудникОбъект.Записать();

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.Родитель = Справочники.ФизическиеЛица.РАБОТАЮЩИЕ;
	СотрудникОбъект.Записать();

КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
	КонецЕсли;

КонецПроцедуры

